{
    "preUni": {
      "Name": "",
      "Church": "",
      "University": "",
      "Course/Year": ""
    },
    "Section 1 – Uni Logistics": [
      "How long do you usually take to plan what modules you’re going to take?",
      "What do you consider in the decision-making process of bidding for modules?",
      "What is the most efficient way I should bid for my modules such that I can get most (if not all) the modules I want?",
      "What do you do if you don’t get the modules you want?",
      "How did you decide which hostel to stay in? What kind of criteria did you use to make your choice?",
      "What made you decide to stay in the hostel? (eg. too far from home, want to experience independent life etc.)",
      "Are there many commitments for living in a hostel? (eg. taking up extra CCAs, participating in hostel activities etc.)"
    ],
    "Section 2 – Seniors’ experience": {
      "Staying in the loop": [
        "What are some must-join Telegram groups? (aside from your respective UCF Tele groups of course)",
        "Is it absolutely necessary to join orientation camps? Will I lose out a lot if I don’t?",
        "If I don’t like too much rah-rah, which orientation camps should I join?"
      ],
      "Dealing with exams/lessons": [
        "How do you manage stress during exams?",
        "Any tips on burning out? How can I prevent burnout in the first place?",
        "How did you cope with difficult teammates in group projects? What advice would you give about overcoming this issue?",
        "How do I survive 8am lectures?",
        "How to stay awake in lessons after lunch/super long lecture?😵😵😵"
      ],
      "Seniors’ favourites": [
        "Which canteen in your Uni is the nicest?",
        "Which food stalls are the cheapest?",
        "What is your personal favourite food from Uni? Or if you don’t have one, what would you recommend?",
        "Which locations on campus are the best for quiet studying?",
        "Which locations on campus are good to hang out with friends?"
      ]
    },
    "Section 3 – Faith in Uni": [
      "How do I maintain my faith during exam periods/chiong periods?",
      "What bible verse/hymn keeps you going in Uni?",
      "How do you balance church work and school work? Have you ever felt overwhelmed by either?",
      "How do you ensure that you don’t compromise on Bible reading/prayer time during the semester?"
    ]
  }
  